# coding: UTF-8
from common.MiralLogger import MiralLogger
import webapp2
from google.appengine.ext import ndb

from kind.master.MstTrainKind import MstTrainKind
class importTrainKind(webapp2.RequestHandler):
    
    data = [
        [1004,2,"東北新幹線","トウホクシンカンセン",1004],
        [1005,2,"上越新幹線","ジョウエツシンカンセン",1005],
        [1006,2,"上越新幹線(ガーラ湯沢支線)","ジョウエツシンカンセン",1006],
        [1007,2,"山形新幹線","ヤマガタシンカンセン",1007],
        [1008,2,"秋田新幹線","アキタシンカンセン",1008],
        [1009,2,"北陸新幹線","ホクリクシンカンセン",1009],
        [11201,2,"JR東北本線(八戸～青森)","トウホクホンセン",11201],
        [11202,2,"JR奥羽本線(新庄～青森)","オウウホンセン",11202],
        [11231,2,"JR東北本線(黒磯～利府・盛岡)","トウホクホンセン",11202],
        [11203,2,"はまなすベイライン大湊線","ハマナスベイラインオオミナトセン",11203],
        [11204,2,"JR五能線","ゴノウセン",11204],
        [11205,2,"JR津軽線","ツガルセン",11205],
        [11206,2,"JR八戸線","ハチノヘセン",11206],
        [11207,2,"JR岩泉線","イワイズミセン",11207],
        [11208,2,"ドラゴンレール大船渡線","ドラゴンレールオオフナトセン",11208],
        [11209,2,"銀河ドリームライン釜石線","ギンガドリームラインカマイシセン",11209],
        [11210,2,"JR北上線","キタカミセン",11210],
        [11211,2,"JR田沢湖線","タザワコセン",11211],
        [11212,2,"十和田八幡平四季彩ライン","トワダハチマンタイシキサイライン",11212],
        [11213,2,"JR山田線","ヤマダセン",11213],
        [11214,2,"JR羽越本線","ウエツホンセン",11214],
        [11215,2,"JR男鹿線","オガセン",11215],
        [11216,2,"山形線","ヤマガタセン",11216],
        [11217,2,"JR仙山線","センザンセン",11217],
        [11218,2,"フルーツライン左沢線","フルーツラインアテラザワセン",11218],
        [11219,2,"JR米坂線","ヨネサカセン",11219],
        [11220,2,"奥の細道最上川ライン","オクノホソミチモガミガワライン",11220],
        [11221,2,"奥の細道湯けむりライン","オクノホソミチユケムリライン",11221],
        [11222,2,"JR仙石線","センセキセン",11222],
        [11223,2,"JR石巻線","イシノマキセン",11223],
        [11224,2,"JR気仙沼線","ケセンヌマセン",11224],
        [11225,2,"JR磐越西線(郡山～会津若松)","バンエツサイセン",11225],
        [11226,2,"森と水とロマンの鉄道","モリトミズトロマンノテツドウ",11226],
        [11227,2,"JR只見線","タダミセン",11227],
        [11228,2,"ゆうゆうあぶくまライン","ユウユウアブクマライン",11228],
        [11229,2,"JR常磐線(取手～いわき)","ジョウバンセン",11229],
        [11230,2,"JR常磐線(いわき～仙台)","ジョウバンセン",11230],
        [11301,2,"JR東海道本線(東京～熱海)","トウカイドウホンセン",11301],
        [11302,2,"JR山手線","ヤマノテセン",11302],
        [11303,2,"JR南武線","ナンブセン",11303],
        [11304,2,"JR鶴見線","ツルミセン",11304],
        [11305,2,"JR武蔵野線","ムサシノセン",11305],
        [11306,2,"JR横浜線","ヨコハマセン",11306],
        [11307,2,"JR根岸線","ネギシセン",11307],
        [11308,2,"JR横須賀線","ヨコスカセン",11308],
        [11309,2,"JR相模線","サガミセン",11309],
        [11311,2,"JR中央本線(東京～塩尻)","チュウオウホンセン",11311],
        [11312,2,"JR中央線(快速)","チュウオウセン",11312],
        [11313,2,"JR中央・総武線","チュウオウ・ソウブセン",11313],
        [11314,2,"JR総武本線","ソウブホンセン",11314],
        [11315,2,"JR青梅線","オウメセン",11315],
        [11316,2,"JR五日市線","イツカイチセン",11316],
        [11317,2,"JR八高線(八王子～高麗川)","ハチコウセン",11317],
        [11318,2,"JR八高線(高麗川～高崎)","ハチコウセン",11318],
        [11319,2,"宇都宮線","ウツノミヤセン",11319],
        [11320,2,"JR常磐線(上野～取手)","ジョウバンセン",11320],
        [11321,2,"JR埼京線","サイキョウセン",11321],
        [11322,2,"JR川越線","カワゴエセン",11322],
        [11323,2,"JR高崎線","タカサキセン",11323],
        [11324,2,"JR外房線","ソトボウセン",11324],
        [11325,2,"JR内房線","ウチボウセン",11325],
        [11326,2,"JR京葉線","ケイヨウセン",11326],
        [11327,2,"JR成田線","ナリタセン",11327],
        [11328,2,"JR成田エクスプレス","ナリタエクスプレス",11328],
        [11329,2,"JR鹿島線","カシマセン",11329],
        [11330,2,"JR久留里線","クルリセン",11330],
        [11331,2,"JR東金線","トウガネセン",11331],
        [11332,2,"JR京浜東北線","ケイヒントウホクセン",11332],
        [11333,2,"JR湘南新宿ライン","ショウナンシンジュクライン",11333],
        [11343,2,"上野東京ライン","ウエノトウキョウライン",11333],
        [11334,2,"JR烏山線","カラスヤマセン",11334],
        [11335,2,"JR吾妻線","アヅマセン",11335],
        [11337,2,"JR信越本線","シンエツホンセン",11337],
        [11338,2,"JR水郡線","スイグンセン",11338],
        [11339,2,"JR水戸線","ミトセン",11339],
        [11340,2,"JR日光線","ニッコウセン",11340],
        [11341,2,"JR両毛線","リョウモウセン",11341],
        [11342,2,"JR上越線","ジョウエツセン",11342],
        [11401,2,"八ヶ岳高原線","ヤツガダケコウゲンセン",11401],
        [11403,2,"JR信越本線(篠ノ井～長野)","シンエツホンセン",11403],
        [11404,2,"JR信越本線(直江津～新潟)","シンエツホンセン",11404],
        [11406,2,"JR白新線","ハクシンセン",11406],
        [11407,2,"JR飯山線","イイヤマセン",11407],
        [11408,2,"JR越後線","エチゴセン",11408],
        [11409,2,"北アルプス線","キタアルプスセン",11409],
        [11410,2,"JR弥彦線","ヤヒコセン",11410],
        [11412,2,"JR篠ノ井線","シノノイセン",11412],
        [11504,2,"JR伊東線","イトウセン",11504],
        [25001,15,"小田急線","オダキュウセン",25001],
        [25002,15,"小田急江ノ島線","オダキュウエノシマセン",25002],
        [25003,15,"小田急多摩線","オダキュウタマセン",25003],
        [28001,18,"東京メトロ銀座線","ギンザセン",28001],
        [28002,18,"東京メトロ丸ノ内線","マルノウチセン",28002],
        [28003,18,"東京メトロ日比谷線","ヒビヤセン",28003],
        [28004,18,"東京メトロ東西線","トウザイセン",28004],
        [28005,18,"東京メトロ千代田線","チヨダセン",28005],
        [28006,18,"東京メトロ有楽町線","ユウラクチョウセン",28006],
        [28007,18,"東京メトロ有楽町新線","ユウラクチョウシンセン",28007],
        [28008,18,"東京メトロ半蔵門線","ハンゾウモンセン",28008],
        [28009,18,"東京メトロ南北線","ナンボクセン",28009],
        [28010,18,"東京メトロ副都心線","フクトシンセン",28010],
     ]
    
    def outDB(self):
        log = MiralLogger()
        
        #データクリア
        ndb.delete_multi(
            MstTrainKind.query().fetch(keys_only=True)
        )        
        
        for row in self.data:
            
            train =  MstTrainKind(
                            trainCd=int(row[0]),
                            trainCompanyCd=row[1],
                            trainName=row[2],
                            trainNameKana=row[3],
                            displayOrder=row[4]
                                  )
            train.put()
        
        
    def get(self):
        self.outDB()
        self.response.out.write(u'終了!')
        